In [2]:
import pandas as pd

train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [3]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [5]:
train['Age'] = train['Age'].fillna(train['Age'].mean())
test['Age'] = test['Age'].fillna(test['Age'].mean())

In [6]:
test['Fare'] = test['Fare'].fillna(train['Fare'].median())

In [7]:
train['Embarked'] = train['Embarked'].fillna('S')

In [8]:
train = train.drop(['Cabin'], axis=1)
test = test.drop(['Cabin'], axis=1)

In [9]:
train.info()
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         418 non-null    float64
 9   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 32.8+ KB

In [10]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,13.002015,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,29.699118,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [11]:
# 3 표준편차를 벗어난 경우
max_std = train['Fare'].mean() + 3 * train['Fare'].std()
max_std

181.2844937601173

In [12]:
# 1.5 IQR을 벗어난 경우
IQR = train['Fare'].quantile(.75) - train['Fare'].quantile(.25)
max_quart = train['Fare'].quantile(.75) + 1.5 * IQR
max_quart

65.6344

In [13]:
train[(train['Fare'] > max_std)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.000000,3,2,19950,263.0000,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.000000,3,2,19950,263.0000,S
118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24.000000,0,1,PC 17558,247.5208,C
258,259,1,1,"Ward, Miss. Anna",female,35.000000,0,0,PC 17755,512.3292,C
299,300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.000000,0,1,PC 17558,247.5208,C
311,312,1,1,"Ryerson, Miss. Emily Borie",female,18.000000,2,2,PC 17608,262.3750,C
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.000000,3,2,19950,263.0000,S
377,378,0,1,"Widener, Mr. Harry Elkins",male,27.000000,0,2,113503,211.5000,C
380,381,1,1,"Bidois, Miss. Rosalie",female,42.000000,0,0,PC 17757,227.5250,C
438,439,0,1,"Fortune, Mr. Mark",male,64.000000,1,4,19950,263.0000,S
527,528,0,1,"Farthing, Mr. John",male,29.699118,0,0,PC 17483,221.7792,S
557,558,0,1,"Robbins, Mr. Victor",male,29.699118,0,0,PC 17757,227.5250,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.000000,0,1,PC 17755,512.3292,C
689,690,1,1,"Madill, Miss. Georgette Alexandra",female,15.000000,0,1,24160,211.3375,S
700,701,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.000000,1,0,PC 17757,227.5250,C
716,717,1,1,"Endres, Miss. Caroline Louise",female,38.000000,0,0,PC 17757,227.5250,C
730,731,1,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,211.3375,S
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.000000,0,0,PC 17755,512.3292,C
742,743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.000000,2,2,PC 17608,262.3750,C
779,780,1,1,"Robert, Mrs. Edward Scott (Elisabeth Walton Mc...",female,43.000000,0,1,24160,211.3375,S

In [14]:
# 값을 max_std로 변경
train.loc[(train['Fare']>max_std), 'Fare'] = max_std

In [15]:
train[(train['Fare'] > max_std)]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Embarked]
Index: []

In [16]:
train['Name'].value_counts()

Braund, Mr. Owen Harris                     1
Boulos, Mr. Hanna                           1
Frolicher-Stehli, Mr. Maxmillian            1
Gilinski, Mr. Eliezer                       1
Murdlin, Mr. Joseph                         1
                                           ..
Kelly, Miss. Anna Katherine "Annie Kate"    1
McCoy, Mr. Bernard                          1
Johnson, Mr. William Cahoone Jr             1
Keane, Miss. Nora A                         1
Dooley, Mr. Patrick                         1
Name: Name, Length: 891, dtype: int64

In [17]:
# 불필요한 칼럼 제거
train_onehot = train.loc[:,['Survived','Pclass','Sex','Age','SibSp','Parch','Fare','Embarked']]

# 타입 변경
train_onehot['Pclass'] = train_onehot['Pclass'].astype('category')
train_onehot['Sex'] = train_onehot['Sex'].astype('category')
train_onehot['Embarked'] = train_onehot['Embarked'].astype('category')

# 원핫인코딩
train_onehot = pd.get_dummies(train_onehot)
train_onehot.head(3)

# # 불필요한 칼럼 제거
test_onehot = test.loc[:,['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked']]

# # 타입 변경
test_onehot['Pclass'] = test_onehot['Pclass'].astype('category')
test_onehot['Sex'] = test_onehot['Sex'].astype('category')
test_onehot['Embarked'] = test_onehot['Embarked'].astype('category')

# 원핫인코딩
test_onehot = pd.get_dummies(test_onehot)
test_onehot.head(3)

,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,34.5,0,0,7.8292,0,0,1,0,1,0,1,0
1,47.0,1,0,7.0000,0,0,1,1,0,0,0,1
2,62.0,0,0,9.6875,0,1,0,0,1,0,1,0

In [18]:
# minmax normalize
train_min, train_max = train_onehot.min(axis=0), train_onehot.max(axis=0)
train_nomalize = (train_onehot - train_min) / (train_max - train_min)
train_nomalize.head(3)

,Survived,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0.0,0.271174,0.125,0.0,0.039992,0.0,0.0,1.0,0.0,1.0,0.0,0.0,1.0
1,1.0,0.472229,0.125,0.0,0.393212,1.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0
2,1.0,0.321438,0.000,0.0,0.043716,0.0,0.0,1.0,1.0,0.0,0.0,0.0,1.0

In [19]:
# minmax normalize
test_min, test_max = train_min.drop(['Survived']), train_max.drop(['Survived'])
test_normal = (test_onehot - test_min) / (test_max - test_min)
test_normal.head(3)

,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0.428248,0.000,0.0,0.043187,0.0,0.0,1.0,0.0,1.0,0.0,1.0,0.0
1,0.585323,0.125,0.0,0.038613,0.0,0.0,1.0,1.0,0.0,0.0,0.0,1.0
2,0.773813,0.000,0.0,0.053438,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0

In [21]:
# 표준정규화
train_mean, train_std = train_onehot.mean(axis=0), train_onehot.std(axis=0)
train_standard = (train_onehot - train_mean) / train_std
train_standard.head(3)

,Survived,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,-0.788829,-0.592148,0.432550,-0.473408,-0.615143,-0.565368,-0.509865,0.902081,-0.737281,0.737281,-0.481772,-0.30739,0.615493
1,1.266279,0.638430,0.432550,-0.473408,1.115974,1.766775,-0.509865,-1.107304,1.354813,-1.354813,2.073341,-0.30739,-1.622891
2,1.266279,-0.284503,-0.474279,-0.473408,-0.596895,-0.565368,-0.509865,0.902081,1.354813,-1.354813,-0.481772,-0.30739,0.615493

## 정규화 파이썬 실습

In [26]:
import random
import numpy as np
numbers = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11])
print("max : ", numbers.max())
print("min : ", numbers.min())

# 최대최소 정규화
minmax = (numbers - numbers.min()) / (numbers.max() - numbers.min())
np.round(minmax,2)

max :  11
min :  1

array([0. , 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1. ])

In [32]:
print("mean : ", numbers.mean())
print("std : ", numbers.std())

# 표준정규화
standard = (numbers - numbers.mean()) / numbers.std()
np.round(standard, 2)

print(standard.mean(), standard.std())

mean :  6.0
std :  3.1622776601683795
1.0092936587501423e-16 1.0

In [27]:
# 파이썬은 데이터에 집중
a = [1,2,3,4]
a * 2

[1, 2, 3, 4, 1, 2, 3, 4]

In [28]:
# numpy는 수치를 다루기 위한 라이브러리
a = np.array([1,2,3,4])
a * 2

array([2, 4, 6, 8])

In [33]:
train_nomalize.columns

Index(['Survived', 'Age', 'SibSp', 'Parch', 'Fare', 'Pclass_1', 'Pclass_2',
       'Pclass_3', 'Sex_female', 'Sex_male', 'Embarked_C', 'Embarked_Q',
       'Embarked_S'],
      dtype='object')

In [35]:
# 독립변수, 종속변수
y_train = train_nomalize[['Survived']]
x_train = train_nomalize.drop(['Survived'], axis=1)
print(x_train.shape, y_train.shape)

(891, 12) (891, 1)

In [37]:
x_train.head(3)

,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0.271174,0.125,0.0,0.039992,0.0,0.0,1.0,0.0,1.0,0.0,0.0,1.0
1,0.472229,0.125,0.0,0.393212,1.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0
2,0.321438,0.000,0.0,0.043716,0.0,0.0,1.0,1.0,0.0,0.0,0.0,1.0

In [38]:
y_titanic = train_nomalize[['Survived']]
x_titanic = train_nomalize.drop(['Survived'], axis=1)

In [39]:
# train / val

x_train, x_val = x_titanic[:600], x_titanic[600:]
print(x_train.shape, x_val.shape)
y_train, y_val = y_titanic[:600], y_titanic[600:]
print(y_train.shape, y_val.shape)

(600, 12) (291, 12)
(600, 1) (291, 1)

In [42]:
from sklearn.neighbors import KNeighborsClassifier
# 모델 선택 및 모델 학습
model = KNeighborsClassifier(n_neighbors=5)
model.fit(x_train, y_train['Survived'])

KNeighborsClassifier()

In [43]:
# 모델 이용 및 평가
y_pred = model.predict(x_train)
sum(y_train['Survived'] == y_pred) / len(y_pred)

0.8383333333333334

In [45]:
y_pred = model.predict(x_val)
sum(y_val['Survived'] == y_pred) / len(y_pred)

0.8006872852233677